# import math # math.sqrt
# from math import * # sqrt
# from math import sqrt, pi, ceil # sqrt

# 2. Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

my_list =["123", "234", 123, "567"]

if 123 in my_list:
    print('Да')
 