import os
os.system('cls||clear')

def game(li):
    x = 'X'
    x0 = '0'
    co = 1
    
    while co < 10:
        re = 0
        if co%2:
            print('Ход игрока Х: ')     
            a = int(input('Введите строку: '))
            b = int(input('Введите столбец: '))
            if li[a-1][b-1] != '_':
                while re < 3:
                    print('ЭТА ЯЧЕЙКА ЗАНЯТА ----> Введите верную ячейку: ')     
                    a = int(input('Введите строку: '))
                    b = int(input('Введите столбец: '))
                    if li[a-1][b-1] == '_':
                        break
            li[a-1][b-1] = x
        else:
            print('Ход игрока 0: ')     
            a = int(input('Введите строку: '))
            b = int(input('Введите столбец: '))
            if li[a-1][b-1] != '_':
                while re < 3:
                    print('ЭТА ЯЧЕЙКА ЗАНЯТА ----> Введите верную ячейку: ')     
                    a = int(input('Введите строку: '))
                    b = int(input('Введите столбец: '))
                    if li[a-1][b-1] == '_':
                        break
            li[a-1][b-1] = x0
            
        for el in li:
            print(el[0] + ' | ' + el[1] + ' | ' + el[2])

        if '0' == li[0][0] == li[0][1] ==li[0][2] or '0' == li[1][0] == li[1][1] == li[1][2] or '0' == li[2][0] == li[2][1] == li[2][2]:
            print('\n Победил игрок 0\n __КОНЕЦ__')  # по строкам
            break
        elif '0' == li[0][0] == li[1][0] ==li[2][0] or '0' == li[0][1] == li[1][1] == li[2][1] or '0' == li[0][2] == li[1][2] == li[2][2]:
            print('\n Победил игрок 0\n __КОНЕЦ__')  #  по столбцам
            break
        elif '0' == li[0][0] == li[1][1] ==li[2][2] or '0' == li[0][2] == li[1][1] ==li[2][0]:
            print('\n Победил игрок 0\n __КОНЕЦ__')  #  по диагонали
            break
        elif 'X' == li[0][0] == li[0][1] ==li[0][2] or 'X' == li[1][0] == li[1][1] == li[1][2] or 'X' == li[2][0] == li[2][1] == li[2][2]:
            print('\n Победил игрок X\n __КОНЕЦ__')   # по строкам
            break
        elif 'X' == li[0][0] == li[1][0] ==li[2][0] or 'X' == li[0][1] == li[1][1] == li[2][1] or 'X' == li[0][2] == li[1][2] == li[2][2]:
            print('\n Победил игрок X\n __КОНЕЦ__')   #  по столбцам
            break
        elif 'X' == li[0][0] == li[1][1] ==li[2][2] or 'X' == li[0][2] == li[1][1] ==li[2][0]:
            print('\n Победил игрок X\n __КОНЕЦ__')  #  по диагонали
            break
        
        print('---------------------')
        co += 1


def main():

    my_li = [['_','_','_'], ['_','_','_'], ['_','_','_']]
    for el in my_li:
            print(el[0] + ' | ' + el[1] + ' | ' + el[2])
    game(my_li)
    

if __name__ == "__main__":
	main()




 